# MEPSystem Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..MEPSystem Property
Connector Class See Also
---
The system of the connector belong to.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPSystem MEPSystem { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MEPSystem As MEPSystem
	Get
```

Visual C++
---
```text
public:
property MEPSystem^ MEPSystem {
	MEPSystem^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown on failure to get system. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace